app/controllers/sites_controller.rb

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_site
      @site = Site.find(params[:id])