app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["email", "prova@pippo.com"], ["created_at", "2017-06-30 22:57:23.472257"], ["updated_at", "2017-06-30 22:57:23.472257"]]
---
  def create
	  @subscriber = Subscriber.new(subscriber_params)
	  if @subscriber.save