app/controllers/users_controller.rb

  def show
	if current_user.admin? && current_user!= @user
		redirect_to edit_user_path
	else
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def ban
    @user = User.find(params[:id])
    @user.update_attributes(banned: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "banned" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["banned", "t"], ["updated_at", "2017-07-03 21:35:22.692215"], ["id", 1]]

  def index
    if !logged_in?
      redirect_to signup_path
    else  @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"